pmo-dataset/variations/graphviz_with_ids/25.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "User_1" [label="Submit job\napplication"];
  "User_2" [label="Report"];
  "User_3" [label="Interview candidate"];
  "User_4" [label="Evaluate job\napplication"];
  "User_5" [label="Enter probation\nphase"];
  "User_6" [label="Evaluate company"];
  "User_7" [label="Evaluate employee"];
  "User_8" [label="Do temp-to-perm"];
  "User_9" [label="Send rejection Email"];
  "Service_1" [label="Confirm job\napplication"];
  "Service_2" [label="Process job\napplication"];
  "Service_3" [label="Send autogenerated\nrejection Email"];
  "Service_4" [label="Publish applicant's\nreview"];
  "StartNoneEvent_1" [shape=circle, label="Job needed"];
  "EndNoneEvent_1" [shape=circle, penwidth=4, label="Job found"];
  "IntermediateTimerEvent_1" [shape=doublecircle, label="One year"];
  "ExclusiveGateway_1" [shape=diamond, label="Is job application\naccepted?"];
  "ExclusiveGateway_2" [shape=diamond, label="Is job application\naccepted?"];
  "ExclusiveGateway_3" [shape=diamond, label="Is candidate\nselected?"];
  "ExclusiveGateway_4" [shape=diamond, label="Is one of the rating\nresults C or less?"];
  "ExclusiveGateway_5" [shape=diamond, label="X"];
  "ExclusiveGateway_6" [shape=diamond, label="X"];
  "ExclusiveGateway_7" [shape=diamond, label="X"];
  "ExclusiveGateway_8" [shape=diamond, label="X"];
  "ExclusiveGateway_9" [shape=diamond, label="Report Required?"];
  "ExclusiveGateway_10" [shape=diamond, label="X"];
  "ExclusiveGateway_11" [shape=diamond, label="Is any job offer\nreceived?"];
  "ExclusiveGateway_12" [shape=diamond, label="X"];
  "ParallelGateway_1" [shape=diamond, label="+"];
  "ParallelGateway_2" [shape=diamond, label="+"];
  "ParallelGateway_3" [shape=diamond, label="+"];
  "ParallelGateway_4" [shape=diamond, label="+"];

  "ParallelGateway_1" -> "Service_1";
  "ParallelGateway_1" -> "Service_2";
  "Service_1" -> "ParallelGateway_2";
  "Service_2" -> "ParallelGateway_2";
  "ExclusiveGateway_1" -> "User_4" [label="Yes"];
  "User_4" -> "ExclusiveGateway_2";
  "ExclusiveGateway_2" -> "ExclusiveGateway_12" [label="Yes"];
  "User_3" -> "ExclusiveGateway_3";
  "ExclusiveGateway_3" -> "User_5" [label="Yes"];
  "User_5" -> "ParallelGateway_3";
  "ParallelGateway_3" -> "User_6";
  "User_6" -> "ParallelGateway_4";
  "ParallelGateway_3" -> "User_7";
  "ExclusiveGateway_4" -> "User_8" [label="No"];
  "User_7" -> "ParallelGateway_4";
  "Service_3" -> "ExclusiveGateway_6";
  "ExclusiveGateway_2" -> "User_9" [label="No"];
  "ExclusiveGateway_1" -> "Service_3" [label="No"];
  "ExclusiveGateway_7" -> "ExclusiveGateway_6";
  "User_9" -> "ExclusiveGateway_7";
  "ExclusiveGateway_8" -> "ExclusiveGateway_7";
  "User_8" -> "IntermediateTimerEvent_1";
  "ParallelGateway_2" -> "ExclusiveGateway_1";
  "User_1" -> "ExclusiveGateway_9";
  "StartNoneEvent_1" -> "ExclusiveGateway_5";
  "User_2" -> "ExclusiveGateway_10";
  "ExclusiveGateway_9" -> "ExclusiveGateway_10" [label="No"];
  "ExclusiveGateway_9" -> "User_2" [label="Yes"];
  "ExclusiveGateway_10" -> "ParallelGateway_1";
  "ExclusiveGateway_5" -> "ExclusiveGateway_8";
  "ExclusiveGateway_12" -> "User_3";
  "ExclusiveGateway_6" -> "ExclusiveGateway_11";
  "ExclusiveGateway_11" -> "User_1" [label="No"];
  "ExclusiveGateway_11" -> "ExclusiveGateway_12" [label="Yes"];
  "ExclusiveGateway_4" -> "ExclusiveGateway_5" [label="Yes"];
  "ExclusiveGateway_3" -> "ExclusiveGateway_8" [label="No"];
  "ParallelGateway_4" -> "ExclusiveGateway_4";
  "IntermediateTimerEvent_1" -> "Service_4";
  "Service_4" -> "EndNoneEvent_1";
}
